Repository: AMA2581/Maccy
Catalog: Maccy/Settings/*.lproj/AdvancedSettings.strings
Languages: bs, cs, it, ko, th, tr

# Title
source: Advanced
bs: Napredno
cs: Pokročilé
it: Avanzate
ko: 고급
th: ขั้นสูง
tr: Gelişmiş

source: Turn off
bs: Ugasi
cs: Vypnout
it: Disattivare
ko: 끄기
th: ปิด
tr: Kapat

# TurnOffDescription
source: Temporarily ignore all new copies. You are likely to use it programmatically and disable application while copying sensitive data.
bs: Privremeno zanemari sve nove kopije. Koristi programski i onemogućiti aplikaciju dok kopirate osjetljive podatke.
cs: Dočasně ignorovat všechny nové kopie. Pravděpodobně toto použiješ programově a zakážeš aplikaci při kopírování citlivých dat.
it: Ignora temporaneamente tutte le nuove copie. È probabile che verrà utilizzato a livello di programmazione e disabiliti l'applicazione durante la copia di dati sensibili.
ko: 일시적으로 모든 새로운 복사를 무시합니다. 중요한 데이터를 복사하는 동안 프로그래밍 방식을 이용해 어플리케이션을 비활성화할 수 있습니다.
th: ไม่สนใจการคัดลอกทั้งหมดชั่วคราว. ดูเหมือนว่าคุณตั้งค่าปิดการทำงานแอปขณะคัดลอกข้อมูลสำคัญ
tr: Geçici olarak tüm yeni kopyaları yok say. Bunu, büyük olasılıkla programsal olarak kullanırsınız ve önemli verilerinizi kopyalarken uygulamayı devre dışı bırakırsınız.

# TurnOffShellScript
source: defaults write org.p0deje.Maccy ignoreEvents true # copy data defaults write org.p0deje.Maccy ignoreEvents false
bs: defaults write org.p0deje.Maccy ignoreEvents true # kopirati podatke defaults write org.p0deje.Maccy ignoreEvents false
cs: defaults write org.p0deje.Maccy ignoreEvents true # kopírovat data defaults write org.p0deje.Maccy ignoreEvents false
it: defaults write org.p0deje.Maccy ignoreEvents true # copia dei dati defaults write org.p0deje.Maccy ignoreEvents false
ko: defaults write org.p0deje.Maccy ignoreEvents true # 데이터 복사 defaults write org.p0deje.Maccy ignoreEvents false
th: defaults write org.p0deje.Maccy ignoreEvents true # คัดลอกข้อมูล defaults write org.p0deje.Maccy ignoreEvents false
tr: defaults write org.p0deje.Maccy ignoreEvents true # verileri kopyala defaults write org.p0deje.Maccy ignoreEvents false

# TurnOffViaMenuIconDescription
source: You can also click the menu icon with ⌥ pressed. To ignore only the next copy, click with ⌥⇧.
bs: Takođe možeš kliknuti na ikonu menija sa pritisnutim ⌥. Da zanemariš samo sljedeću kopiju, kliknite sa ⌥⇧.
cs: Můžeš také kliknut na menu ikonu při stisknutí ⌥. Pro ignorování následující kopie stiskni s ⌥⇧.
it: Puoi anche fare clic sull'icona del menu premendo ⌥. Per ignorare solo la copia successiva, fare clic con ⌥⇧.
ko: ⌥를 누른 상태에서 메뉴 아이콘을 클릭할 수도 있습니다. 다음 사본만 무시하려면 ⌥⇧로 클릭하십시오.
th: คุณยังสามารถคลิกไอคอนเมนูโดยกด ⌥ หากต้องการละเว้นเฉพาะสำเนาถัดไป ให้คลิกด้วย ⌥⇧
tr: Aynı zamanda, ⌥ basılıyken menü simgesine tıklayabilirsiniz. Yalnızca sonraki kopyayı yok saymak için ⌥⇧ ile tıklayın.

# TurnOffNextShellScript
source: defaults write org.p0deje.Maccy ignoreOnlyNextEvent true # copy data
bs: defaults write org.p0deje.Maccy ignoreOnlyNextEvent true # kopirati podatke
cs: defaults write org.p0deje.Maccy ignoreOnlyNextEvent true # kopírovat data
it: defaults write org.p0deje.Maccy ignoreOnlyNextEvent true # copia dei dati
ko: defaults write org.p0deje.Maccy ignoreOnlyNextEvent true # 데이터 복사
th: defaults write org.p0deje.Maccy ignoreOnlyNextEvent true # คัดลอกข้อมูล
tr: defaults write org.p0deje.Maccy ignoreOnlyNextEvent true # verileri kopyala

source: Avoid taking application focus
bs: Izbjegni fokusiranje na aplikaciju
cs: Nepřebírat pozici aktivní aplikace
it: Impedisci di prendere il focus dell'applicazione
ko: 어플리케이션 포커싱 방지
th: หลีกเลี่ยงแอปหลุดการทำงาน
tr: Uygulama odağını almaktan kaçın

# AvoidTakingApplicationFocusTooltip
source: Maccy takes an active application focus when the popup is shown and gives focus back when it's closed. The focus is needed for advanced macOS input handling such as Chinese helper or accent menu. Enabling this option would prevent Maccy from taking focus. There are certain situations when this can be useful: for example, pasting to a text editor that auto-formats code when it loses focus.
bs: Maccy preuzima aktivan fokus aplikacije kada se prikaže iskačući prozor i vraća fokus kada je zatvoren. Fokus je potreban za napredno rukovanje unosom u macOS-u kao što je kineski pomoćnik ili meni za naglaske. Omogućavanje ove opcije spriječilo bi Maccyja da se fokusira. Postoje određene situacije kada ovo može biti korisno: na primjer, lijepljenje u uređivač teksta koji automatski formatira kod kada izgubi fokus.
cs: Maccy přebírá pozici aktivní aplikace, když je zobrazený popup a předává ji zpět když je zavřen. Pozice je potřeba pro pokročilé funkce macOS nakládání se vstupy jako je čínská pomoc, nebo menu diakritiky. Povolení této možnosti by zamezilo Maccy převzít pozici aktivní aplikace. Jsou některé situace, kdy to může být užitečné, jako například vkládání do textového editoru, který autoformátuje kód při ztrátě pozice aktivní aplikace.
it: Maccy attiva il focus dell'applicazione quando viene mostrato il popup e lo restituisce quando viene chiuso. Il focus è necessario per la gestione avanzata dell'input macOS come l'helper per il cinese o il menu degli accenti. Abilitare questa opzione impedirebbe a Maccy di prendere il focus. Ci sono alcune situazioni in cui questo può essere utile: ad esempio, incollare in un editor di testo che formatta automaticamente il codice quando perde il focus.
ko: Maccy는 팝업이 표시될 때 활성 어플리케이션 포커스를 가져오고 닫힐 때 다시 포커스를 제공합니다. 중국어 도우미 또는 액센트 메뉴와 같은 macOS 고급 입력 처리에는 포커스가 필요합니다. 이 옵션을 활성화하면 Maccy가 포커스를 가져오는 것을 방지할 수 있습니다. 이것이 유용할 수 있는 특정 상황들이 있습니다. 예: 포커스를 잃을 때 코드를 자동으로 서식 지정하는 텍스트 에디터에 붙여넣을 때.
th: Maccy จะทำการกับแอป Active อยู่. จำเป็นต้องมีตั้งค่าสำหรับการจัดการ input ของ macOS ในระดับสูง เช่น ตัวช่วยการพิมพ์ภาษาจีนหรือเมนูอื่นๆ. เปิดตัวเลือกนี้ป้องกันไม่ให้ Maccy หลุดการทำงาน. มีบางสถาการณ์ที่จะเป็นประโยชน์ เช่น การวางลงแอปแก้ไขข้อความ เพื่อป้องกันการหลุดการทำงาน
tr: Maccy, açılır pencere gösterildiğinde etkin uygulamanın odağını alır ve kapatıldığında geri verir. Odak, gelişmiş macOS girdi işlemesi için gereklidir; örn. Çince yardımcısı veya vurgu menüsü. Bu seçeneği etkinleştirmek, Maccy'nin odağı alamamasına neden olur. Bunun yararlı olabileceği kimi durumlar vardır; örneğin odağı kaybettiğinde kodu kendiliğinden biçimlendiren bir metin düzenleyiciye yapıştırırken.

source: Clear history on quit
bs: Očisti historiju pri izlasku iz aplikacije
cs: Vymazat historii při ukončení
it: Elimina la cronologia e chiudi
ko: 종료시 기록 지우기
th: ล้างประวัติเมื่อออก
tr: Çıkışta geçmişi temizle

# ClearHistoryOnQuitTooltip
source: Automatically remove all unpinned items before quitting the application.
bs: Automatski ukloni sve zakačene stavke prije zatvaranja aplikacije.
cs: Automaticky odebrat všechny nepřipnuté položky před ukončením aplikace.
it: Rimuovi automaticamente gli elementi non bloccati prima di chiudere l'applicazione.
ko: 애플리케이션을 종료하기 전에 고정 해제된 모든 항목을 자동으로 제거합니다.
th: ลบรายการที่เลิกปักหมุดทั้งหมดออกโดยอัตโนมัติก่อนออกจากแอปพลิเคชัน
tr: Uygulamadan çıkmadan önce tüm iğnesi çıkarılmış ögeleri kendiliğinden kaldır.

# ClearSystemClipboard
source: Clear the system clipboard too
bs: Očistite i sistemski međuspremnik
cs: Vymazat taky systémovou schránku
it: Cancella anche gli appunti di sistema
ko: 시스템 클립보드도 지우기
th: ล้างคลิปบอร์ดของระบบด้วย
tr: Sistem panosunu da temizle

# ClearSystemClipboardTooltip
source: When enabled, clearing the history would also clear the current system clipboard.
bs: Kada je omogućeno, brisanje historije će također izbrisati trenutni sistemski međuspremnik.
cs: Pokud je povoleno, smazání historie smaže i aktuální systémovou schránku.
it: Se abilitato, la cancellazione della cronologia cancellerebbe anche gli appunti di sistema correnti.
ko: 활성화되면 기록을 지우면 현재 시스템 클립보드도 지워집니다.
th: เมื่อเปิดใช้งาน การล้างประวัติจะเป็นการล้างคลิปบอร์ดของระบบปัจจุบันด้วย
tr: Etkinleştirildiğinde, geçmişin temizlenmesi mevcut sistem panosunu da temizler.
